Revit 2026 API

# ViewFamilyTypeDefaultTemplateId Property

---

The default template id assigned to this view type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId DefaultTemplateId { get; set; }
```
```vb
Public Property DefaultTemplateId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ DefaultTemplateId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member DefaultTemplateId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: val is not valid as a default template id. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This value will be the view template for all newly created instances of this view type.

#### Reference

ViewFamilyType Class

Autodesk.Revit.DB Namespace